app/views/carts/show.html.haml

SELECT "cartships".* FROM "cartships" WHERE "cartships"."cart_id" = ?  [["cart_id", 1]]
---
		%th Total
	- @cart.cartships.each do |cartship|