app/controllers/application_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def load_cart
		@@users = User.all
		@cart = Cart.find(session[:cart_id]) if session[:cart_id].present?