app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@cart = Cart.find(params[:id])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["status", "copleted"], ["updated_at", "2018-12-29 09:19:25.863388"], ["id", 1]]
---
	def pay
		@cart = Cart.find(params[:id])
		# Set your secret key: remember to change this to your live secret key in production
		# See your keys here: https://dashboard.stripe.com/account/apikeys
		Stripe.api_key = "sk_test_BslPnG2L9OI0qdPgY30TgFYS"

		# Token is created using Checkout or Elements!
		# Get the payment token ID submitted by the form:
		token = params[:stripeToken]

		charge = Stripe::Charge.create({
		    amount: (@cart.total_price * 100).to_i, # Amount in cent
		    currency: 'usd',
		    description: 'Payment for cart #{@cart.id}',
		    source: token,
		})
		@cart.update(status: "copleted")