app/controllers/products_controller.rb

SELECT "users".* FROM "users"
SELECT "products".* FROM "products"
---
  def index
    @users = User.all
    @products = Product.all

INSERT INTO "carts" ("status", "created_at", "updated_at") VALUES (?, ?, ?)  [["status", "pending"], ["created_at", "2019-11-06 17:59:46.781546"], ["updated_at", "2019-11-06 17:59:46.781546"]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cartships" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 4], ["product_id", 3], ["quantity", 1], ["created_at", "2019-11-06 17:59:46.877949"], ["updated_at", "2019-11-06 17:59:46.877949"]]
---
  def add_to_cart
    if session[:cart_id].blank?
    cart = Cart.create(status: "pending")
    session[:cart_id] = cart.id
    else
      cart = Cart.find(session[:cart_id])
    end
    product = Product.find(params[:id])
    cart.cartships.create(product_id: product.id, quantity: 1)