app/models/cart.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def total_price
		cartships.map { |cartship| cartship.quantity * cartship.product.price }.sum