app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rafik22@rambler.ru"], ["LIMIT", 1]]
---
	 def self.new_with_session(params, session)
	   super.tap do |user|
	     if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
	       user.email = data["email"] if user.email.blank?

INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "provider", "uid", "name", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "2231156060280741"], ["LIMIT", 1]]
---
	 def self.from_omniauth(auth)
	   where(provider: auth.provider, uid: auth.uid).first_or_create do |user|